aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/U5_stm32_cyhal_sdio.c
        /* Set the CMD53 byte mode size to be the same as the block size */
        if (arg.cmd53.block_mode == 0U)
        {
            if (_stm32_sdio_find_optimal_block_size(arg.cmd53.count) <
                _CYHAL_SDIO_DATA_BLOCK_SIZE_512B)
            {
                arg.cmd53.count = _stm32_sdio_find_optimal_block_size(arg.cmd53.count);
            }
            else
            {
                arg.cmd53.count = 0u;
            }
        }

        obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;
        obj->hsd->State     = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        obj->hsd->Instance->DCTRL = 0u;

        if (use_temp_dma_buffer)
        {
            if ((length == 0) || (length > sizeof(_temp_dma_buffer)))
            {
                obj->hsd->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_BAD_ARGUMENT;
            }

            /* Using internal buffer */
            p_dma_buffer = _temp_dma_buffer;

            /* Clean internal buffer and copy data */
            (void)memcpy((void*)_temp_dma_buffer, (void*)data, length);

            if (length != sizeof(_temp_dma_buffer))
            {
                (void)memset((void*)&((uint8_t*)_temp_dma_buffer)[length], 0,
                             sizeof(_temp_dma_buffer) - length);
            }
        }
        else
        {
            /* Use app data buffer */
            p_dma_buffer = (uint32_t*)data;
        }

        /* Maintenance D-cache for DMA buffers */
        #if defined(_CYHAL_DCACHE_MAINTENANCE)
        if (direction == CYHAL_WRITE)
        {
            SCB_CleanDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
        }
        else
        {
            /* Cache-Invalidate the output from DMA */
            SCB_InvalidateDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
        }
        #endif /* if defined(_CYHAL_DCACHE_MAINTENANCE) */

        /* DMA configuration (use single buffer) */
        obj->hsd->Instance->IDMACTRL  = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
        obj->hsd->Instance->IDMABASER = (uint32_t)p_dma_buffer;

        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT;
        config.TransferDir = (direction == CYHAL_WRITE) ? SDMMC_TRANSFER_DIR_TO_CARD :
                             SDMMC_TRANSFER_DIR_TO_SDMMC;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_DISABLE;
        config.DataLength    = block_size * number_of_blocks;
        config.DataBlockSize = _stm32_sdio_convert_block_size((uint16_t)block_size);

        obj->hsd->Instance->DCTRL |= SDMMC_DCTRL_SDIOEN; /* SD I/O enable functions */
        (void)SDMMC_ConfigData(obj->hsd->Instance, &config);

        __SDMMC_CMDTRANS_ENABLE(obj->hsd->Instance);

        /* Call CMD53 (CYHAL_SDIO_CMD_IO_RW_EXTENDED) */
        result = cyhal_sdio_send_cmd(obj, direction, CYHAL_SDIO_CMD_IO_RW_EXTENDED,
                                     arg.value, response);

        /* Check error from CMD53 */
        if (result != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDMMC_STATIC_FLAGS);
            obj->hsd->State = HAL_SD_STATE_READY;
            return result;
        }

        /* Set polling flags */
        flags = SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND |
                SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_RXOVERR;

        /* Poll on SDMMC flags */
        while ((!__HAL_SD_GET_FLAG(obj->hsd, flags)) && (timeout > 0u))
        {
            /* returning ERROR code for timeout */
            HAL_Delay(1U);
            timeout--;
            if (timeout == 0u)
            {
                obj->hsd->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_RET_CMD_TIMEOUT;
            }
        }

        /* Check for SDMMC interrupt flags */
        if (__HAL_SD_GET_FLAG(obj->hsd, SDMMC_FLAG_DATAEND) != RESET)
        {
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDMMC_FLAG_DATAEND);
        }
        else if (__HAL_SD_GET_FLAG(obj->hsd, SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
                                   SDMMC_FLAG_RXOVERR | SDMMC_FLAG_TXUNDERR) != RESET)
        {
            /* Set Error code */
            if (__HAL_SD_GET_FLAG(obj->hsd, SDMMC_FLAG_DCRCFAIL) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDMMC_FLAG_DTIMEOUT) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDMMC_FLAG_RXOVERR) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDMMC_FLAG_TXUNDERR) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_TX_UNDERRUN;
            }
        }
        else
        {
            /* Nothing to do */
        }

        /* Set SDIO to init state */
        __HAL_SD_DISABLE_IT(obj->hsd, SDMMC_IT_IDMABTC);
        __SDMMC_CMDTRANS_DISABLE(obj->hsd->Instance);

        obj->hsd->Instance->DLEN     = 0;
        obj->hsd->Instance->DCTRL    = SDMMC_DCTRL_SDIOEN;
        obj->hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
        //__SDIO_OPERATION_DISABLE(obj->hsd->Instance);
        obj->hsd->Instance->CMD      = 0;
        obj->hsd->Instance->DCTRL   |= SDMMC_DCTRL_FIFORST;

        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(obj->hsd, SDMMC_STATIC_DATA_FLAGS);

        /* Copy received data to user */
        if ((direction == CYHAL_READ) && (use_temp_dma_buffer) && (!obj->hsd->ErrorCode))
        {
            (void)memcpy((void*)data, (void*)_temp_dma_buffer, (size_t)length);
        }

        /* Set the SD state to ready to be able to start again the process */
        _cyhal_sdio_handle->State = HAL_SD_STATE_READY;

        /* This interrupt is disabled in interrupt handler so need to enable it here */
        if (0U != ((uint32_t)CYHAL_SDIO_CARD_INTERRUPT & obj->irq))
        {
            __HAL_SD_ENABLE_IT(obj->hsd, SDMMC_IT_SDIOIT);
        }
    }
    else
    {
        obj->hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
        return CYHAL_SDIO_RSLT_ERR_PM_PENDING;
    }

    if (obj->hsd->ErrorCode == HAL_SD_ERROR_NONE)
    {
        result = CY_RSLT_SUCCESS;
    }
    else
    {
        result = CYHAL_SDIO_RET_NO_SP_ERRORS; /**< Non-specific error code*/
    }
    return result;
}


/***************************************************************************************************
 * cyhal_sdio_register_callback
 **************************************************************************************************/
void cyhal_sdio_register_callback(cyhal_sdio_t* obj, cyhal_sdio_event_callback_t callback,
                                  void* callback_arg)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != callback);

